console.log('Привет')
console.log('123')
console.log('снова привет')

let message = 'Привет' // обЬявление переменной

console.log(message)

message = 'Пока' // присваивание переменной значения
console.log(message)
const mes = 'Привет' //обЬявление неизменной переменной ее нельзя в дальнейшем переопределить
mes = 'hi' // будет ошибка в коде так как изменять нельзя

const 
    name = 'ALexandr',
    age = '28'
    //можно назвать сразу несколько переменных в одной но лучше этого избегать

'use strict' // строгий режим позволяет задать более строгий подход к написанию код,
             // к примеру называть переменные только с использованием const let var

let $name // такие и тому подобные имена можно использовать самое главное имя начинается не с цифры
let mame$
let _name
let name2

//let 2name //недоступимое имя переменной оно не должно начинаться с цифры